{
  "source": "https://bersamadakwah.net/doa-doa-lengkap/",
  "based_on": "Majmu' Syarif",
  "data": [
    {
      "id": 1,
      "title": "Doa Keluar Rumah",
      "arabic": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهُِ",
      "translation": "Artinya: Dengan nama Allah, aku bertawakkal kepada Allah, tiada daya dan kekuatan kecuali dari Allah…"
    },
    {
      "id": 2,
      "title": "Doa Masuk Rumah",
      "arabic": "اللَّهُمَّ إِنِّى أَسْأَلُكَ خَيْرَ الْمَوْلِجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللَّهِ وَلَجْنَا وَبِسْمِ اللَّهِ خَرَجْنَا وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَاْ",
      "translation": "Artinya: Ya Allah, sesungguhnya aku meminta kepadaMu kebaikan tempat masuk dan kebaikan tempat keluar. Dengan nama Allah aku masuk dan dengan nama Allah aku keluar. Dan kepada Allah Tuhan kami, kami bertawakkal"
    },
    {
      "id": 3,
      "title": "Doa Pergi ke Masjid",
      "arabic": "اللَّهُمَّ اجْعَلْ فِى قَلْبِى نُورًا . وَفِى بَصَرِى نُورًا . وَفِى سَمْعِى نُورًا . وَعَنْ يَمِينِى نُورًا . وَعَنْ يَسَارِى نُورًا . وَفَوْقِى نُورًا . وَتَحْتِى نُورًا . وَأَمَامِى نُورًا . وَخَلْفِى نُورًا . وَاجْعَلْ لِى نُورًٌ",
      "translation": "Artinya : Dengan menyebut nama Allah yang maha pengasih lagi maha penyayang. Katakanlah, ‘Dialah yang maha esa. Allah adalah tuhan tempat bergantung oleh segala sesuatu. Dia tidak beranak dan tidak diperanakkan. Dan tidak ada seorangpun yang setara dengan-Nya’. (3 kali)"
    },
    {
      "id": 4,
      "title": "Doa Masuk Masjid",
      "arabic": "اللَّهُمَّ افْتَحْ لِى أَبْوَابَ رَحْمَتِكَُ",
      "translation": "Artinya: Ya Allah, bukakanlah pintu-pintu rahmatMu untukku"
    },
    {
      "id": 5,
      "title": "Doa Keluar Masjid",
      "arabic": "اللَّهُمَّ إِنِّى أَسْأَلُكَ مِنْ فَضْلِكََ",
      "translation": "Artinya: Ya Allah, sesungguhnya aku memohon keutamaan kepadaMu’"
    },
    {
      "id": 6,
      "title": "Doa Setelah Adzan",
      "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِى وَعَدْتَُ",
      "translation": "Artinya: Ya Allah, Tuhan panggilan yang sempurna dan shalat yang akan didirikan ini. Berikanlah wasilah dan keutamaan kepada Muhammad. Bangkitkanlah dia pada kedudukan yang terpuji seperti yang Engkau janjikan kepadanya."
    },
    {
      "id": 7,
      "title": "Doa Setelah Wudhu",
      "arabic": "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُِ",
      "translation": "Artinya: Aku bersaksi bahwa tiada tuhan selain Allah Yang Maha Esa, tiada sekutu bagiNya. Dan aku bersaksi bahwa Muhammad adalah hamba dan utusanNya.’"
    },
    {
      "id": 8,
      "title": "Doa Naik Kendaraan",
      "arabic": "سُبْحَانَ الَّذِى سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَُ",
      "translation": "Artinya: Mahasuci Dia yang telah menundukkan semua ini bagi kami padahal sebelumnya kami tidak mampu menguasainya. Dan sesungguhnya kami akan kembali kepada Tuhan kami."
    },
    {
      "id": 9,
      "title": "Doa Masuk Pasar",
      "arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكُ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِى وَيُمِيتُ وَهُوَ حَىٌّ لاَ يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْ",
      "translation": "Artinya: Tiada tuhan selain Allah Yang Maha Esa, tiada sekutu bagiNya. Dia yang mempunyai kerajaan dan segala pujian. Dialah yang menghidupkan dan mematikan, dan Dia Mahahidup yang tidak mati. Di tangan-Nya segala kebaikan dan Dia Mahakuasa atas segala sesuatu."
    },
    {
      "id": 10,
      "title": "Doa Sebelum Belajar",
      "arabic": "رَبِّ زِدْنِي عِلْمًا  وَارْزُقْنِي فَهْمًا وَاجْعَلْنِي مِنَ الصَّالِحِيْنََ",
      "translation": "Artinya: Ya Allah, tambahkanlah aku ilmu. Berilah aku karunia agar dapat memahaminya. Dan jadikanlah aku termasuk orang-orang yang shalih."
    },
    {
      "id": 11,
      "title": "Doa Ketika Turun Hujan",
      "arabic": "اللَّهُمَّ صَيِّبًا نَافِعًاًُ",
      "translation": "Artinya: Ya Allah, mohon turunkan hujan yang deras lagi bermanfaat"
    },
    {
      "id": 12,
      "title": "Doa Setelah Turun Hujan",
      "arabic": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهُِ",
      "translation": "Artinya: Kami dianugerahi hujan karena karunia dan rahmat Allah"
    },
    {
      "id": 13,
      "title": "Doa Ketika Angin Kencang",
      "arabic": "للَّهُمَّ إِنِّى أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا أُرْسِلَتْ بِهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أُرْسِلَتْ بِهَِ",
      "translation": "Artinya: Ya Allah, sesungguhnya aku memohon kebaikannya, kebaikan yang ada di dalamnya  dan kebaikan yang Engkau kirimkan dengannya. Dan aku berlindung dari keburukannya, keburukan yang ada di dalamnya dan keburukan yang Engkau kirimkan dengannya."
    },
    {
      "id": 14,
      "title": "Doa Ketika Ada Petir",
      "arabic": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهَِ",
      "translation": "Artinya: Mahasuci Allah yang dengan memuji-Nya bertasbihlah halilintar dan juga para malaikat karena takut kepadaNya."
    },
    {
      "id": 15,
      "title": "Doa Bangun Tidur",
      "arabic": "الْحَمْدُ لِلَّهِ الَّذِى أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورٌُ",
      "translation": "Artinya: Segala puji bagi Allah yang telah menghidupkan kami setelah Dia mematikan kami. Dan kepadaNyalah kami kembali."
    },
    {
      "id": 16,
      "title": "Doa Bercermin",
      "arabic": "اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
      "translation": "Artinya: Ya Allah, sebagaimana Engkau baguskan tubuhku, maka baguskanlah akhlaqku"
    },
    {
      "id": 17,
      "title": "Doa Masuk Kamar Mandi",
      "arabic": "اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
      "translation": "Artinya: Ya Allah, sesungguhnya aku berlindung kepadaMu dari setan laki-laki dan setan perempuan"
    },
    {
      "id": 18,
      "title": "Doa Keluar Kamar Mandi",
      "arabic": "غُفْرَانَكََ",
      "translation": "Artinya: Aku mohon ampunanMu ya Allah."
    },
    {
      "id": 19,
      "title": "Doa Memakai Pakaian",
      "arabic": "الْحَمْدُ لِلَّهِ الَّذِى كَسَانِى هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّى وَلاَ قُوَّةٍَ",
      "translation": "Artinya: Segala puji bagi Allah yang telah memberikan pakaian dan rezeki kepadaku tanpa daya dan upaya dariku"
    },
    {
      "id": 20,
      "title": "Doa Melepas Pakaian",
      "arabic": "بِسْمِ اللَّهِ الَّذِى لَا إِلَهَ إِلَّا هُوَُ",
      "translation": "Artinya: Dengan nama Allah yang tiada tuhan selain Dia"
    },
    {
      "id": 21,
      "title": "Doa Sebelum Makan",
      "arabic": "اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ",
      "translation": "Artinya: Ya Allah, berkahilah kami dalam apa-apa yang Engkau rezekikan kepada kami dan hindarkan kami dari siksa neraka"
    },
    {
      "id": 22,
      "title": "Doa Setelah Makan",
      "arabic": "الْحَمْدُ لِلَّهِ الَّذِى أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينََ",
      "translation": "Artinya: Segala puji bagi Allah yang telah memberi makan dan minum kepada kami dan menjadikan kami orang-orang muslim\n\n"
    }

  ]
}